import { Component, OnInit } from '@angular/core';

@Component({
  selector: 'app-home',
  templateUrl: './home.component.html',
  styleUrls: ['./home.component.scss']
})
export class HomeComponent implements OnInit {
  data: any;
  constructor() { }

  ngOnInit() {

    this.data = [
      {
        titlename: "สมเด็จชานหมาก",
        subtitlename: "สมเด็จชานหมาก ลพ.คง วัดชำป่าง่าม พิมพ์ปรกโพธิ์หลังยันต์ตรี",
        img: "https://lh3.googleusercontent.com/proxy/2OSz7i7fmlzApwOnxjvlUcb7Z-h56e6cySG5Vsr3N4xXWFjsPJP0MPeWLgYI1Gd15-0JJ14r2IgOMalDp88bTodvVk-otOse5_5Nz5ThFRhadRVAV50L",
        about:"พระสมเด็จหลวงพ่อคง วัดชำป่าง่าม จ.ฉะเชิงเทรา พิมพ์ปรกโพธิ์หลังยันต์ตรี(นิยม) เนื้อผงผสมชานหมากหลวงพ่อคงท่านได้จัดสร้างพระในยุคแรกๆประมาณปี พ.ศ 2477 แบ่งออกเป็น 4 พิมพ์ คือ 1.พระสมเด็จปรกโพธิ์หลังยันต์ตรี 2.พระสมเด็จปรกโพธิ์หลังเรียบ 3.พระสมเด็จพิมพ์ใหญ่หลังเรียบ 4.พระปิดตา ส่วนเหรียญท่านได้จัดสร้างในปี พ.ศ.2483 พระผงผสมชานหมากตัวจริงเสียงจริงนั้นหาชมได้ยากมากๆ ปัจุบันพระสมเด็จชานหมากของท่านนั้นได้กลายเป็นพระในตำนานของเมืองแปดริ้วไปแล้วครับ"
        // หลวงพ่อคง สุวัณณ เป็นชาวเขมร แขวงเมืองพระตะบอง เกิดเมื่อปี พ.ศ.2377 บรรพชาเป็นสามเณรตั้งแต่อายุ 15 ปี
        // จนอายุครบบวชจึงอุปสมบทเป็นพระภิกษุ และเริ่มศึกษาพุทธาคมและไสยเวทจากพระคณาจารย์ชาวเขมรที่มีชื่อเสียงด้าน
        // เวทมนตร์
        // ในสมัยนั้น เมืองพระตะบองอยู่ภายใต้ราชอาณาจักรไทย มีเจ้าพระยาอภัยภูเบศร์ (ชุ่ม อภัยวงศ์)
        // เป็นผู้สำเร็จราชการดูแลอยู่ ท่านมีความเคารพเลื่อมใสในหลวงพ่อคงเป็นอย่างสูง เมื่อจะเดินทางกลับเมืองไทย
        // เนื่องจากต้องยกเมืองพระตะบองให้ฝรั่งเศส ท่านจึงนิมนต์หลวงพ่อคงให้ร่วมคณะกลับมาด้วย
        // เพื่อเป็นขวัญและกำลังใจในการเดินทางให้ราบรื่น เมื่อมาถึงแถบอำเภอพนมสารคามซึ่งเป็นป่าดงดิบ
        // หลวงพ่อคงเห็นว่าเป็นอาณาบริเวณที่เงียบสงบ เหมาะอย่างยิ่งสำหรับการเจริญวิปัสสนากรรมฐาน
        // ท่านจึงขอพำนักในบริเวณดังกล่าว เจ้าพระยาอภัยภูเบศร์จึงได้สร้างกุฏิและเสนาสนะถวาย
        // หลวงพ่อคงก็จำพรรษาตั้งแต่บัดนั้นเป็นต้นมา
        // ความที่ท่านเจริญด้วยวัตรปฏิบัติและด้วยอภินิหารความศักดิ์สิทธิ์เป็นที่ ปรากฏ ชาวบ้านเริ่มเดินทางไปกราบนมัสการ
        // และร่วมกันปลูกสร้างศาสนสถานและเสนาสนะต่างๆ จนกลายเป็นพระอารามให้ชื่อว่า "วัดซำป่าง่าม"
        // และเจริญรุ่งเรืองจนปัจจุบัน หลวงพ่อคงมรณภาพเมื่อปี พ.ศ.2485 สิริอายุ 108 ปี"
      },
      {
        titlename: "สมเด็จชานหมาก",
        subtitlename: "สมเด็จชานหมาก ลพ.คง วัดชำป่าง่าม พิมพ์ปรกโพธิ์หลังยันต์ตรี",
        img: "https://lh3.googleusercontent.com/proxy/2OSz7i7fmlzApwOnxjvlUcb7Z-h56e6cySG5Vsr3N4xXWFjsPJP0MPeWLgYI1Gd15-0JJ14r2IgOMalDp88bTodvVk-otOse5_5Nz5ThFRhadRVAV50L",
        about:"พระสมเด็จหลวงพ่อคง วัดชำป่าง่าม จ.ฉะเชิงเทรา พิมพ์ปรกโพธิ์หลังยันต์ตรี(นิยม) เนื้อผงผสมชานหมากหลวงพ่อคงท่านได้จัดสร้างพระในยุคแรกๆประมาณปี พ.ศ 2477 แบ่งออกเป็น 4 พิมพ์ คือ 1.พระสมเด็จปรกโพธิ์หลังยันต์ตรี 2.พระสมเด็จปรกโพธิ์หลังเรียบ 3.พระสมเด็จพิมพ์ใหญ่หลังเรียบ 4.พระปิดตา ส่วนเหรียญท่านได้จัดสร้างในปี พ.ศ.2483 พระผงผสมชานหมากตัวจริงเสียงจริงนั้นหาชมได้ยากมากๆ ปัจุบันพระสมเด็จชานหมากของท่านนั้นได้กลายเป็นพระในตำนานของเมืองแปดริ้วไปแล้วครับ"
        // หลวงพ่อคง สุวัณณ เป็นชาวเขมร แขวงเมืองพระตะบอง เกิดเมื่อปี พ.ศ.2377 บรรพชาเป็นสามเณรตั้งแต่อายุ 15 ปี
        // จนอายุครบบวชจึงอุปสมบทเป็นพระภิกษุ และเริ่มศึกษาพุทธาคมและไสยเวทจากพระคณาจารย์ชาวเขมรที่มีชื่อเสียงด้าน
        // เวทมนตร์
        // ในสมัยนั้น เมืองพระตะบองอยู่ภายใต้ราชอาณาจักรไทย มีเจ้าพระยาอภัยภูเบศร์ (ชุ่ม อภัยวงศ์)
        // เป็นผู้สำเร็จราชการดูแลอยู่ ท่านมีความเคารพเลื่อมใสในหลวงพ่อคงเป็นอย่างสูง เมื่อจะเดินทางกลับเมืองไทย
        // เนื่องจากต้องยกเมืองพระตะบองให้ฝรั่งเศส ท่านจึงนิมนต์หลวงพ่อคงให้ร่วมคณะกลับมาด้วย
        // เพื่อเป็นขวัญและกำลังใจในการเดินทางให้ราบรื่น เมื่อมาถึงแถบอำเภอพนมสารคามซึ่งเป็นป่าดงดิบ
        // หลวงพ่อคงเห็นว่าเป็นอาณาบริเวณที่เงียบสงบ เหมาะอย่างยิ่งสำหรับการเจริญวิปัสสนากรรมฐาน
        // ท่านจึงขอพำนักในบริเวณดังกล่าว เจ้าพระยาอภัยภูเบศร์จึงได้สร้างกุฏิและเสนาสนะถวาย
        // หลวงพ่อคงก็จำพรรษาตั้งแต่บัดนั้นเป็นต้นมา
        // ความที่ท่านเจริญด้วยวัตรปฏิบัติและด้วยอภินิหารความศักดิ์สิทธิ์เป็นที่ ปรากฏ ชาวบ้านเริ่มเดินทางไปกราบนมัสการ
        // และร่วมกันปลูกสร้างศาสนสถานและเสนาสนะต่างๆ จนกลายเป็นพระอารามให้ชื่อว่า "วัดซำป่าง่าม"
        // และเจริญรุ่งเรืองจนปัจจุบัน หลวงพ่อคงมรณภาพเมื่อปี พ.ศ.2485 สิริอายุ 108 ปี"
      },
      {
        titlename: "สมเด็จชานหมาก",
        subtitlename: "สมเด็จชานหมาก ลพ.คง วัดชำป่าง่าม พิมพ์ปรกโพธิ์หลังยันต์ตรี",
        img: "https://lh3.googleusercontent.com/proxy/2OSz7i7fmlzApwOnxjvlUcb7Z-h56e6cySG5Vsr3N4xXWFjsPJP0MPeWLgYI1Gd15-0JJ14r2IgOMalDp88bTodvVk-otOse5_5Nz5ThFRhadRVAV50L",
        about:"พระสมเด็จหลวงพ่อคง วัดชำป่าง่าม จ.ฉะเชิงเทรา พิมพ์ปรกโพธิ์หลังยันต์ตรี(นิยม) เนื้อผงผสมชานหมากหลวงพ่อคงท่านได้จัดสร้างพระในยุคแรกๆประมาณปี พ.ศ 2477 แบ่งออกเป็น 4 พิมพ์ คือ 1.พระสมเด็จปรกโพธิ์หลังยันต์ตรี 2.พระสมเด็จปรกโพธิ์หลังเรียบ 3.พระสมเด็จพิมพ์ใหญ่หลังเรียบ 4.พระปิดตา ส่วนเหรียญท่านได้จัดสร้างในปี พ.ศ.2483 พระผงผสมชานหมากตัวจริงเสียงจริงนั้นหาชมได้ยากมากๆ ปัจุบันพระสมเด็จชานหมากของท่านนั้นได้กลายเป็นพระในตำนานของเมืองแปดริ้วไปแล้วครับ"
        // หลวงพ่อคง สุวัณณ เป็นชาวเขมร แขวงเมืองพระตะบอง เกิดเมื่อปี พ.ศ.2377 บรรพชาเป็นสามเณรตั้งแต่อายุ 15 ปี
        // จนอายุครบบวชจึงอุปสมบทเป็นพระภิกษุ และเริ่มศึกษาพุทธาคมและไสยเวทจากพระคณาจารย์ชาวเขมรที่มีชื่อเสียงด้าน
        // เวทมนตร์
        // ในสมัยนั้น เมืองพระตะบองอยู่ภายใต้ราชอาณาจักรไทย มีเจ้าพระยาอภัยภูเบศร์ (ชุ่ม อภัยวงศ์)
        // เป็นผู้สำเร็จราชการดูแลอยู่ ท่านมีความเคารพเลื่อมใสในหลวงพ่อคงเป็นอย่างสูง เมื่อจะเดินทางกลับเมืองไทย
        // เนื่องจากต้องยกเมืองพระตะบองให้ฝรั่งเศส ท่านจึงนิมนต์หลวงพ่อคงให้ร่วมคณะกลับมาด้วย
        // เพื่อเป็นขวัญและกำลังใจในการเดินทางให้ราบรื่น เมื่อมาถึงแถบอำเภอพนมสารคามซึ่งเป็นป่าดงดิบ
        // หลวงพ่อคงเห็นว่าเป็นอาณาบริเวณที่เงียบสงบ เหมาะอย่างยิ่งสำหรับการเจริญวิปัสสนากรรมฐาน
        // ท่านจึงขอพำนักในบริเวณดังกล่าว เจ้าพระยาอภัยภูเบศร์จึงได้สร้างกุฏิและเสนาสนะถวาย
        // หลวงพ่อคงก็จำพรรษาตั้งแต่บัดนั้นเป็นต้นมา
        // ความที่ท่านเจริญด้วยวัตรปฏิบัติและด้วยอภินิหารความศักดิ์สิทธิ์เป็นที่ ปรากฏ ชาวบ้านเริ่มเดินทางไปกราบนมัสการ
        // และร่วมกันปลูกสร้างศาสนสถานและเสนาสนะต่างๆ จนกลายเป็นพระอารามให้ชื่อว่า "วัดซำป่าง่าม"
        // และเจริญรุ่งเรืองจนปัจจุบัน หลวงพ่อคงมรณภาพเมื่อปี พ.ศ.2485 สิริอายุ 108 ปี"
      },
      {
        titlename: "สมเด็จชานหมาก",
        subtitlename: "สมเด็จชานหมาก ลพ.คง วัดชำป่าง่าม พิมพ์ปรกโพธิ์หลังยันต์ตรี",
        img: "https://lh3.googleusercontent.com/proxy/2OSz7i7fmlzApwOnxjvlUcb7Z-h56e6cySG5Vsr3N4xXWFjsPJP0MPeWLgYI1Gd15-0JJ14r2IgOMalDp88bTodvVk-otOse5_5Nz5ThFRhadRVAV50L",
        about:"พระสมเด็จหลวงพ่อคง วัดชำป่าง่าม จ.ฉะเชิงเทรา พิมพ์ปรกโพธิ์หลังยันต์ตรี(นิยม) เนื้อผงผสมชานหมากหลวงพ่อคงท่านได้จัดสร้างพระในยุคแรกๆประมาณปี พ.ศ 2477 แบ่งออกเป็น 4 พิมพ์ คือ 1.พระสมเด็จปรกโพธิ์หลังยันต์ตรี 2.พระสมเด็จปรกโพธิ์หลังเรียบ 3.พระสมเด็จพิมพ์ใหญ่หลังเรียบ 4.พระปิดตา ส่วนเหรียญท่านได้จัดสร้างในปี พ.ศ.2483 พระผงผสมชานหมากตัวจริงเสียงจริงนั้นหาชมได้ยากมากๆ ปัจุบันพระสมเด็จชานหมากของท่านนั้นได้กลายเป็นพระในตำนานของเมืองแปดริ้วไปแล้วครับ"
        // หลวงพ่อคง สุวัณณ เป็นชาวเขมร แขวงเมืองพระตะบอง เกิดเมื่อปี พ.ศ.2377 บรรพชาเป็นสามเณรตั้งแต่อายุ 15 ปี
        // จนอายุครบบวชจึงอุปสมบทเป็นพระภิกษุ และเริ่มศึกษาพุทธาคมและไสยเวทจากพระคณาจารย์ชาวเขมรที่มีชื่อเสียงด้าน
        // เวทมนตร์
        // ในสมัยนั้น เมืองพระตะบองอยู่ภายใต้ราชอาณาจักรไทย มีเจ้าพระยาอภัยภูเบศร์ (ชุ่ม อภัยวงศ์)
        // เป็นผู้สำเร็จราชการดูแลอยู่ ท่านมีความเคารพเลื่อมใสในหลวงพ่อคงเป็นอย่างสูง เมื่อจะเดินทางกลับเมืองไทย
        // เนื่องจากต้องยกเมืองพระตะบองให้ฝรั่งเศส ท่านจึงนิมนต์หลวงพ่อคงให้ร่วมคณะกลับมาด้วย
        // เพื่อเป็นขวัญและกำลังใจในการเดินทางให้ราบรื่น เมื่อมาถึงแถบอำเภอพนมสารคามซึ่งเป็นป่าดงดิบ
        // หลวงพ่อคงเห็นว่าเป็นอาณาบริเวณที่เงียบสงบ เหมาะอย่างยิ่งสำหรับการเจริญวิปัสสนากรรมฐาน
        // ท่านจึงขอพำนักในบริเวณดังกล่าว เจ้าพระยาอภัยภูเบศร์จึงได้สร้างกุฏิและเสนาสนะถวาย
        // หลวงพ่อคงก็จำพรรษาตั้งแต่บัดนั้นเป็นต้นมา
        // ความที่ท่านเจริญด้วยวัตรปฏิบัติและด้วยอภินิหารความศักดิ์สิทธิ์เป็นที่ ปรากฏ ชาวบ้านเริ่มเดินทางไปกราบนมัสการ
        // และร่วมกันปลูกสร้างศาสนสถานและเสนาสนะต่างๆ จนกลายเป็นพระอารามให้ชื่อว่า "วัดซำป่าง่าม"
        // และเจริญรุ่งเรืองจนปัจจุบัน หลวงพ่อคงมรณภาพเมื่อปี พ.ศ.2485 สิริอายุ 108 ปี"
      },
      {
        titlename: "สมเด็จชานหมาก",
        subtitlename: "สมเด็จชานหมาก ลพ.คง วัดชำป่าง่าม พิมพ์ปรกโพธิ์หลังยันต์ตรี",
        img: "https://lh3.googleusercontent.com/proxy/2OSz7i7fmlzApwOnxjvlUcb7Z-h56e6cySG5Vsr3N4xXWFjsPJP0MPeWLgYI1Gd15-0JJ14r2IgOMalDp88bTodvVk-otOse5_5Nz5ThFRhadRVAV50L",
        about:"พระสมเด็จหลวงพ่อคง วัดชำป่าง่าม จ.ฉะเชิงเทรา พิมพ์ปรกโพธิ์หลังยันต์ตรี(นิยม) เนื้อผงผสมชานหมากหลวงพ่อคงท่านได้จัดสร้างพระในยุคแรกๆประมาณปี พ.ศ 2477 แบ่งออกเป็น 4 พิมพ์ คือ 1.พระสมเด็จปรกโพธิ์หลังยันต์ตรี 2.พระสมเด็จปรกโพธิ์หลังเรียบ 3.พระสมเด็จพิมพ์ใหญ่หลังเรียบ 4.พระปิดตา ส่วนเหรียญท่านได้จัดสร้างในปี พ.ศ.2483 พระผงผสมชานหมากตัวจริงเสียงจริงนั้นหาชมได้ยากมากๆ ปัจุบันพระสมเด็จชานหมากของท่านนั้นได้กลายเป็นพระในตำนานของเมืองแปดริ้วไปแล้วครับ"
        // หลวงพ่อคง สุวัณณ เป็นชาวเขมร แขวงเมืองพระตะบอง เกิดเมื่อปี พ.ศ.2377 บรรพชาเป็นสามเณรตั้งแต่อายุ 15 ปี
        // จนอายุครบบวชจึงอุปสมบทเป็นพระภิกษุ และเริ่มศึกษาพุทธาคมและไสยเวทจากพระคณาจารย์ชาวเขมรที่มีชื่อเสียงด้าน
        // เวทมนตร์
        // ในสมัยนั้น เมืองพระตะบองอยู่ภายใต้ราชอาณาจักรไทย มีเจ้าพระยาอภัยภูเบศร์ (ชุ่ม อภัยวงศ์)
        // เป็นผู้สำเร็จราชการดูแลอยู่ ท่านมีความเคารพเลื่อมใสในหลวงพ่อคงเป็นอย่างสูง เมื่อจะเดินทางกลับเมืองไทย
        // เนื่องจากต้องยกเมืองพระตะบองให้ฝรั่งเศส ท่านจึงนิมนต์หลวงพ่อคงให้ร่วมคณะกลับมาด้วย
        // เพื่อเป็นขวัญและกำลังใจในการเดินทางให้ราบรื่น เมื่อมาถึงแถบอำเภอพนมสารคามซึ่งเป็นป่าดงดิบ
        // หลวงพ่อคงเห็นว่าเป็นอาณาบริเวณที่เงียบสงบ เหมาะอย่างยิ่งสำหรับการเจริญวิปัสสนากรรมฐาน
        // ท่านจึงขอพำนักในบริเวณดังกล่าว เจ้าพระยาอภัยภูเบศร์จึงได้สร้างกุฏิและเสนาสนะถวาย
        // หลวงพ่อคงก็จำพรรษาตั้งแต่บัดนั้นเป็นต้นมา
        // ความที่ท่านเจริญด้วยวัตรปฏิบัติและด้วยอภินิหารความศักดิ์สิทธิ์เป็นที่ ปรากฏ ชาวบ้านเริ่มเดินทางไปกราบนมัสการ
        // และร่วมกันปลูกสร้างศาสนสถานและเสนาสนะต่างๆ จนกลายเป็นพระอารามให้ชื่อว่า "วัดซำป่าง่าม"
        // และเจริญรุ่งเรืองจนปัจจุบัน หลวงพ่อคงมรณภาพเมื่อปี พ.ศ.2485 สิริอายุ 108 ปี"
      },
      {
        titlename: "สมเด็จชานหมาก",
        subtitlename: "สมเด็จชานหมาก ลพ.คง วัดชำป่าง่าม พิมพ์ปรกโพธิ์หลังยันต์ตรี",
        img: "https://lh3.googleusercontent.com/proxy/2OSz7i7fmlzApwOnxjvlUcb7Z-h56e6cySG5Vsr3N4xXWFjsPJP0MPeWLgYI1Gd15-0JJ14r2IgOMalDp88bTodvVk-otOse5_5Nz5ThFRhadRVAV50L",
        about:"พระสมเด็จหลวงพ่อคง วัดชำป่าง่าม จ.ฉะเชิงเทรา พิมพ์ปรกโพธิ์หลังยันต์ตรี(นิยม) เนื้อผงผสมชานหมากหลวงพ่อคงท่านได้จัดสร้างพระในยุคแรกๆประมาณปี พ.ศ 2477 แบ่งออกเป็น 4 พิมพ์ คือ 1.พระสมเด็จปรกโพธิ์หลังยันต์ตรี 2.พระสมเด็จปรกโพธิ์หลังเรียบ 3.พระสมเด็จพิมพ์ใหญ่หลังเรียบ 4.พระปิดตา ส่วนเหรียญท่านได้จัดสร้างในปี พ.ศ.2483 พระผงผสมชานหมากตัวจริงเสียงจริงนั้นหาชมได้ยากมากๆ ปัจุบันพระสมเด็จชานหมากของท่านนั้นได้กลายเป็นพระในตำนานของเมืองแปดริ้วไปแล้วครับ"
        // หลวงพ่อคง สุวัณณ เป็นชาวเขมร แขวงเมืองพระตะบอง เกิดเมื่อปี พ.ศ.2377 บรรพชาเป็นสามเณรตั้งแต่อายุ 15 ปี
        // จนอายุครบบวชจึงอุปสมบทเป็นพระภิกษุ และเริ่มศึกษาพุทธาคมและไสยเวทจากพระคณาจารย์ชาวเขมรที่มีชื่อเสียงด้าน
        // เวทมนตร์
        // ในสมัยนั้น เมืองพระตะบองอยู่ภายใต้ราชอาณาจักรไทย มีเจ้าพระยาอภัยภูเบศร์ (ชุ่ม อภัยวงศ์)
        // เป็นผู้สำเร็จราชการดูแลอยู่ ท่านมีความเคารพเลื่อมใสในหลวงพ่อคงเป็นอย่างสูง เมื่อจะเดินทางกลับเมืองไทย
        // เนื่องจากต้องยกเมืองพระตะบองให้ฝรั่งเศส ท่านจึงนิมนต์หลวงพ่อคงให้ร่วมคณะกลับมาด้วย
        // เพื่อเป็นขวัญและกำลังใจในการเดินทางให้ราบรื่น เมื่อมาถึงแถบอำเภอพนมสารคามซึ่งเป็นป่าดงดิบ
        // หลวงพ่อคงเห็นว่าเป็นอาณาบริเวณที่เงียบสงบ เหมาะอย่างยิ่งสำหรับการเจริญวิปัสสนากรรมฐาน
        // ท่านจึงขอพำนักในบริเวณดังกล่าว เจ้าพระยาอภัยภูเบศร์จึงได้สร้างกุฏิและเสนาสนะถวาย
        // หลวงพ่อคงก็จำพรรษาตั้งแต่บัดนั้นเป็นต้นมา
        // ความที่ท่านเจริญด้วยวัตรปฏิบัติและด้วยอภินิหารความศักดิ์สิทธิ์เป็นที่ ปรากฏ ชาวบ้านเริ่มเดินทางไปกราบนมัสการ
        // และร่วมกันปลูกสร้างศาสนสถานและเสนาสนะต่างๆ จนกลายเป็นพระอารามให้ชื่อว่า "วัดซำป่าง่าม"
        // และเจริญรุ่งเรืองจนปัจจุบัน หลวงพ่อคงมรณภาพเมื่อปี พ.ศ.2485 สิริอายุ 108 ปี"
      },
      {
        titlename: "สมเด็จชานหมาก",
        subtitlename: "สมเด็จชานหมาก ลพ.คง วัดชำป่าง่าม พิมพ์ปรกโพธิ์หลังยันต์ตรี",
        img: "https://lh3.googleusercontent.com/proxy/2OSz7i7fmlzApwOnxjvlUcb7Z-h56e6cySG5Vsr3N4xXWFjsPJP0MPeWLgYI1Gd15-0JJ14r2IgOMalDp88bTodvVk-otOse5_5Nz5ThFRhadRVAV50L",
        about:"พระสมเด็จหลวงพ่อคง วัดชำป่าง่าม จ.ฉะเชิงเทรา พิมพ์ปรกโพธิ์หลังยันต์ตรี(นิยม) เนื้อผงผสมชานหมากหลวงพ่อคงท่านได้จัดสร้างพระในยุคแรกๆประมาณปี พ.ศ 2477 แบ่งออกเป็น 4 พิมพ์ คือ 1.พระสมเด็จปรกโพธิ์หลังยันต์ตรี 2.พระสมเด็จปรกโพธิ์หลังเรียบ 3.พระสมเด็จพิมพ์ใหญ่หลังเรียบ 4.พระปิดตา ส่วนเหรียญท่านได้จัดสร้างในปี พ.ศ.2483 พระผงผสมชานหมากตัวจริงเสียงจริงนั้นหาชมได้ยากมากๆ ปัจุบันพระสมเด็จชานหมากของท่านนั้นได้กลายเป็นพระในตำนานของเมืองแปดริ้วไปแล้วครับ"
        // หลวงพ่อคง สุวัณณ เป็นชาวเขมร แขวงเมืองพระตะบอง เกิดเมื่อปี พ.ศ.2377 บรรพชาเป็นสามเณรตั้งแต่อายุ 15 ปี
        // จนอายุครบบวชจึงอุปสมบทเป็นพระภิกษุ และเริ่มศึกษาพุทธาคมและไสยเวทจากพระคณาจารย์ชาวเขมรที่มีชื่อเสียงด้าน
        // เวทมนตร์
        // ในสมัยนั้น เมืองพระตะบองอยู่ภายใต้ราชอาณาจักรไทย มีเจ้าพระยาอภัยภูเบศร์ (ชุ่ม อภัยวงศ์)
        // เป็นผู้สำเร็จราชการดูแลอยู่ ท่านมีความเคารพเลื่อมใสในหลวงพ่อคงเป็นอย่างสูง เมื่อจะเดินทางกลับเมืองไทย
        // เนื่องจากต้องยกเมืองพระตะบองให้ฝรั่งเศส ท่านจึงนิมนต์หลวงพ่อคงให้ร่วมคณะกลับมาด้วย
        // เพื่อเป็นขวัญและกำลังใจในการเดินทางให้ราบรื่น เมื่อมาถึงแถบอำเภอพนมสารคามซึ่งเป็นป่าดงดิบ
        // หลวงพ่อคงเห็นว่าเป็นอาณาบริเวณที่เงียบสงบ เหมาะอย่างยิ่งสำหรับการเจริญวิปัสสนากรรมฐาน
        // ท่านจึงขอพำนักในบริเวณดังกล่าว เจ้าพระยาอภัยภูเบศร์จึงได้สร้างกุฏิและเสนาสนะถวาย
        // หลวงพ่อคงก็จำพรรษาตั้งแต่บัดนั้นเป็นต้นมา
        // ความที่ท่านเจริญด้วยวัตรปฏิบัติและด้วยอภินิหารความศักดิ์สิทธิ์เป็นที่ ปรากฏ ชาวบ้านเริ่มเดินทางไปกราบนมัสการ
        // และร่วมกันปลูกสร้างศาสนสถานและเสนาสนะต่างๆ จนกลายเป็นพระอารามให้ชื่อว่า "วัดซำป่าง่าม"
        // และเจริญรุ่งเรืองจนปัจจุบัน หลวงพ่อคงมรณภาพเมื่อปี พ.ศ.2485 สิริอายุ 108 ปี"
      },
      {
        titlename: "สมเด็จชานหมาก",
        subtitlename: "สมเด็จชานหมาก ลพ.คง วัดชำป่าง่าม พิมพ์ปรกโพธิ์หลังยันต์ตรี",
        img: "https://lh3.googleusercontent.com/proxy/2OSz7i7fmlzApwOnxjvlUcb7Z-h56e6cySG5Vsr3N4xXWFjsPJP0MPeWLgYI1Gd15-0JJ14r2IgOMalDp88bTodvVk-otOse5_5Nz5ThFRhadRVAV50L",
        about:"พระสมเด็จหลวงพ่อคง วัดชำป่าง่าม จ.ฉะเชิงเทรา พิมพ์ปรกโพธิ์หลังยันต์ตรี(นิยม) เนื้อผงผสมชานหมากหลวงพ่อคงท่านได้จัดสร้างพระในยุคแรกๆประมาณปี พ.ศ 2477 แบ่งออกเป็น 4 พิมพ์ คือ 1.พระสมเด็จปรกโพธิ์หลังยันต์ตรี 2.พระสมเด็จปรกโพธิ์หลังเรียบ 3.พระสมเด็จพิมพ์ใหญ่หลังเรียบ 4.พระปิดตา ส่วนเหรียญท่านได้จัดสร้างในปี พ.ศ.2483 พระผงผสมชานหมากตัวจริงเสียงจริงนั้นหาชมได้ยากมากๆ ปัจุบันพระสมเด็จชานหมากของท่านนั้นได้กลายเป็นพระในตำนานของเมืองแปดริ้วไปแล้วครับ"
        // หลวงพ่อคง สุวัณณ เป็นชาวเขมร แขวงเมืองพระตะบอง เกิดเมื่อปี พ.ศ.2377 บรรพชาเป็นสามเณรตั้งแต่อายุ 15 ปี
        // จนอายุครบบวชจึงอุปสมบทเป็นพระภิกษุ และเริ่มศึกษาพุทธาคมและไสยเวทจากพระคณาจารย์ชาวเขมรที่มีชื่อเสียงด้าน
        // เวทมนตร์
        // ในสมัยนั้น เมืองพระตะบองอยู่ภายใต้ราชอาณาจักรไทย มีเจ้าพระยาอภัยภูเบศร์ (ชุ่ม อภัยวงศ์)
        // เป็นผู้สำเร็จราชการดูแลอยู่ ท่านมีความเคารพเลื่อมใสในหลวงพ่อคงเป็นอย่างสูง เมื่อจะเดินทางกลับเมืองไทย
        // เนื่องจากต้องยกเมืองพระตะบองให้ฝรั่งเศส ท่านจึงนิมนต์หลวงพ่อคงให้ร่วมคณะกลับมาด้วย
        // เพื่อเป็นขวัญและกำลังใจในการเดินทางให้ราบรื่น เมื่อมาถึงแถบอำเภอพนมสารคามซึ่งเป็นป่าดงดิบ
        // หลวงพ่อคงเห็นว่าเป็นอาณาบริเวณที่เงียบสงบ เหมาะอย่างยิ่งสำหรับการเจริญวิปัสสนากรรมฐาน
        // ท่านจึงขอพำนักในบริเวณดังกล่าว เจ้าพระยาอภัยภูเบศร์จึงได้สร้างกุฏิและเสนาสนะถวาย
        // หลวงพ่อคงก็จำพรรษาตั้งแต่บัดนั้นเป็นต้นมา
        // ความที่ท่านเจริญด้วยวัตรปฏิบัติและด้วยอภินิหารความศักดิ์สิทธิ์เป็นที่ ปรากฏ ชาวบ้านเริ่มเดินทางไปกราบนมัสการ
        // และร่วมกันปลูกสร้างศาสนสถานและเสนาสนะต่างๆ จนกลายเป็นพระอารามให้ชื่อว่า "วัดซำป่าง่าม"
        // และเจริญรุ่งเรืองจนปัจจุบัน หลวงพ่อคงมรณภาพเมื่อปี พ.ศ.2485 สิริอายุ 108 ปี"
      },

    ];
  }

}
